Repository: KQAR/looper
Catalog: Looper/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# alert.error
source: Error
zh_hans: Looper 错误

# alert.ok
source: OK
zh_hans: 好

# board.done.empty
source: Approved work will accumulate here.
zh_hans: 已通过的工作将在这里累积。

# board.done.subtitle
source: Completed
zh_hans: 已完成

# board.done.title
source: Done
zh_hans: 已完成

# board.inProgress.empty
source: No task is currently running in this pipeline.
zh_hans: 当前流水线中没有正在运行的任务。

# board.inProgress.subtitle
source: Actively executing
zh_hans: 正在执行

# board.inProgress.title
source: In Progress
zh_hans: 进行中

# board.inReview.empty
source: Tasks awaiting review will appear here.
zh_hans: 等待审核的任务将显示在这里。

# board.inReview.subtitle
source: Awaiting review
zh_hans: 等待审核

# board.inReview.title
source: In Review
zh_hans: 审核中

# board.todo.empty.feishu
source: No todo task is currently mapped into this pipeline.
zh_hans: 当前没有待处理的任务映射到此流水线。

# board.todo.empty.local
source: No local task has been added to this pipeline yet.
zh_hans: 尚未向此流水线添加本地任务。

# board.todo.subtitle
source: Ready to start
zh_hans: 等待开始

# board.todo.title
source: Todo
zh_hans: 待办

# composer.cancel
source: Cancel
zh_hans: 取消

# composer.createTask
source: Create Task
zh_hans: 创建任务

# composer.newLocalTask
source: New Local Task
zh_hans: 新建本地任务

# composer.newTaskIn %@
source: New Task in %@
zh_hans: %@ 的新任务

# composer.projectPath.field
source: Project Path
zh_hans: 项目路径

# composer.subtitle.noPipeline
source: Create a task inside Looper without relying on any external board.
zh_hans: 在 Looper 内创建任务，无需依赖任何外部看板。

# composer.subtitle.withPipeline
source: Create a task directly inside the selected pipeline without relying on any external board.
zh_hans: 直接在选中的流水线内创建任务，无需依赖任何外部看板。

# composer.summary.field
source: Summary
zh_hans: 摘要

# composer.title.field
source: Title
zh_hans: 标题

# composer.titlePlaceholder
source: Refactor task provider abstraction
zh_hans: 重构任务提供方抽象

# context.deleteConfirm.cancel
source: Cancel
zh_hans: 取消

# context.deleteConfirm.delete
source: Delete
zh_hans: 删除

# context.deleteConfirm.message
source: This will remove the pipeline and its terminal session. Tasks from the provider are not affected.
zh_hans: 这将移除该流水线及其终端会话。来自提供方的任务不受影响。

# context.deleteConfirm.title
source: Delete Pipeline?
zh_hans: 删除流水线？

# context.deletePipeline
source: Delete Pipeline
zh_hans: 删除流水线

# context.rebuildTerminal
source: Rebuild Terminal
zh_hans: 重建终端

# context.revealInFinder
source: Reveal in Finder
zh_hans: 在访达中显示

# error.configureFeishu
source: Configure Feishu App ID, secret, app token, and table ID first.
zh_hans: 请先配置飞书 App ID、Secret、App Token 和数据表 ID。

# error.configureProvider
source: Configure the selected task provider before writing status back.
zh_hans: 请先配置所选的任务提供方，再回写状态。

# error.createPipelineFirst
source: Create or select a pipeline before adding a local task.
zh_hans: 请先创建或选择一个流水线，再添加本地任务。

# error.feishuFieldsRequired
source: App ID, app secret, app token, and table ID are required.
zh_hans: App ID、App Secret、App Token 和数据表 ID 为必填项。

# error.finishCurrentRun
source: Finish the current run in this pipeline before starting another task.
zh_hans: 请先完成此流水线中当前的运行，再启动新任务。

# error.localProviderNotReady
source: Local task provider is not ready.
zh_hans: 本地任务提供方尚未就绪。

# error.localTaskOnlyLocal
source: Local task creation is only available for the Local Tasks provider.
zh_hans: 仅本地任务提供方支持创建本地任务。

# error.maxConcurrentRuns
source: This pipeline has reached its maximum number of concurrent runs.
zh_hans: 此流水线已达到最大并行运行数。

# run.status.failed
source: Failed
zh_hans: 已失败

# run.status.running
source: Running
zh_hans: 运行中

# run.status.succeeded
source: Succeeded
zh_hans: 已成功

# settings.about
source: About
zh_hans: 关于

# settings.about.subtitle
source: Version information and app metadata.
zh_hans: 版本信息和应用元数据。

# settings.build
source: Build
zh_hans: 构建

# settings.checkForUpdates
source: Check for Updates
zh_hans: 检查更新

# settings.closeSettings
source: Close Settings
zh_hans: 关闭设置

# settings.feishu.connection
source: Connection
zh_hans: 连接配置

# settings.feishu.field.repoPath
source: Repo Path
zh_hans: 仓库路径

# settings.feishu.field.status
source: Status
zh_hans: 状态

# settings.feishu.field.summary
source: Summary
zh_hans: 描述

# settings.feishu.field.title
source: Title
zh_hans: 标题

# settings.feishu.fieldMapping
source: Field Mapping
zh_hans: 字段映射

# settings.feishu.fieldMapping.detail
source: Map Bitable column names to Looper task fields.
zh_hans: 将多维表格列名映射到 Looper 任务字段。

# settings.feishu.inspect
source: Inspect Table
zh_hans: 检测表格

# settings.feishu.inspectResult %lld %lld
source: %lld tasks, %lld fields found
zh_hans: 发现 %lld 条任务，%lld 个字段

# settings.feishu.save
source: Save
zh_hans: 保存

# settings.feishu.statusMapping
source: Status Mapping
zh_hans: 状态值映射

# settings.feishu.statusMapping.detail
source: Map Bitable status values to Looper task states.
zh_hans: 将多维表格状态值映射到 Looper 任务状态。

# settings.general
source: General
zh_hans: 通用

# settings.general.agentCommand
source: Agent Command
zh_hans: 代理命令

# settings.general.agentCommandDetail
source: The CLI command used to launch the coding agent.
zh_hans: 用于启动编码代理的 CLI 命令。

# settings.general.postRunGitAction
source: After Task Completes
zh_hans: 任务完成后

# settings.general.postRunGitActionDetail
source: Git action to perform when an agent run succeeds.
zh_hans: 代理运行成功后执行的 Git 操作。

# settings.general.placeholder
source: General settings will be redesigned here.
zh_hans: 通用设置将在此重新设计。

# settings.general.placeholderDetail
source: This section is reserved for future app-level preferences and behavior controls.
zh_hans: 此部分保留用于未来的应用级偏好设置和行为控制。

# settings.general.subtitle
source: Application behavior and defaults.
zh_hans: 应用行为和默认设置。

# settings.language
source: Language
zh_hans: 语言

# settings.language.restartRequired
source: Restart Looper to apply the language change.
zh_hans: 重启 Looper 以应用语言更改。

# settings.language.system
source: System Default
zh_hans: 跟随系统

# settings.language.zhHans
source: Simplified Chinese
zh_hans: 简体中文

# settings.taskProvider
source: Task Provider
zh_hans: 任务来源

# settings.taskProvider.local.description
source: Tasks are managed locally inside Looper. No external connection needed.
zh_hans: 任务在 Looper 内本地管理，无需外部连接。

# settings.taskProvider.source
source: Provider
zh_hans: 来源

# settings.taskProvider.subtitle
source: Configure where tasks come from
zh_hans: 配置任务数据来源

# settings.version
source: Version
zh_hans: 版本

# sidebar.allPipelines
source: All Pipelines
zh_hans: 全部流水线

# sidebar.footer.count %lld
source: %lld pipelines available
zh_hans: %lld 个流水线

# sidebar.footer.empty
source: Create your first pipeline to keep a project workstation warm.
zh_hans: 创建你的第一个流水线，保持项目工作区活跃。

# sidebar.linkedTasks %lld
source: %lld linked tasks
zh_hans: %lld 个关联任务

# sidebar.newPipeline
source: New Pipeline
zh_hans: 新建流水线

# sidebar.pipelines
source: Pipelines
zh_hans: 流水线

# sidebar.settings
source: Settings
zh_hans: 设置

# status.done
source: Done
zh_hans: 已完成

# status.inProgress
source: In Progress
zh_hans: 进行中

# status.inReview
source: In Review
zh_hans: 审核中

# status.todo
source: Todo
zh_hans: 待办

# task.done
source: Done
zh_hans: 完成

# task.inspect
source: Inspect
zh_hans: 查看

# task.markReview
source: Mark for Review
zh_hans: 提交审核

# task.noProject
source: No Project
zh_hans: 无项目

# task.returnToTodo
source: Return to Todo
zh_hans: 退回待办

# task.selected
source: Selected
zh_hans: 已选中

# task.start
source: Start
zh_hans: 开始

# task.terminalActive
source: Viewing
zh_hans: 查看中

# task.terminalShow
source: Terminal
zh_hans: 终端

# toolbar.addTask
source: Add Task
zh_hans: 添加任务

# toolbar.refresh
source: Refresh
zh_hans: 刷新

# workspace.attach
source: Attach
zh_hans: 连接

# workspace.attachAgain
source: Attach Again
zh_hans: 重新连接

# workspace.newPipeline
source: New Pipeline
zh_hans: 新建流水线

# workspace.noPipeline.default
source: Create a pipeline first. The entire right side becomes that pipeline's workspace.
zh_hans: 先创建一个流水线，右侧区域将成为该流水线的工作区。

# workspace.noPipeline.onboarding
source: Open Settings, choose a task provider, and set local defaults before creating the first pipeline.
zh_hans: 打开设置，选择任务提供方，并配置本地默认值，然后创建第一个流水线。

# workspace.noPipelineSelected
source: No Pipeline Selected
zh_hans: 未选择流水线

# workspace.openSettings
source: Open Settings
zh_hans: 打开设置

# workspace.preparingTerminal
source: Preparing terminal surface...
zh_hans: 正在准备终端...

# workspace.startingSession
source: Starting terminal session
zh_hans: 正在启动终端会话

# workspace.title
source: Workspace
zh_hans: 工作区
